const questions=[
    {
        id:1,
        question:"چطور می‌توانم سفارشم را پیگیری کنم؟",
        answer:"وارد سایت دیجی‌کالا شوید. روی گزینه سفارش‌های من کلیک کنید. در این قسمت با کلیک روی جزییات می‌توانید سفارش خود را ببینید. می‌توانید در این قسمت روند آماده‌سازی و مراحل ارسال سفارش خود را پیگیری کنید."
    },
    {
        id:2,
        question:"هزینه روش‌های ارسال با اشتراک دیجی‌پلاس چقدر است؟",
        answer:"اعضای دیجی‌پلاس می‌توانند به ازای هر ماه اشتراک، چهار ارسال رایگان بر روی مرسوله های عادی داشته باشند،به جز ارسال توسط فروشنده ، باربری و سفارش های سوپر مارکتی زیر ۸۰ هزار تومان."
    },
    {
        id:3,
        question:"چطور میتوانم سفارشم را لغو کنم ؟",
        answer:"شما میتوانید با مراجعه به پروفایل خود سفارش یا مرسوله ایی که از ارسال آن منصرف شدید را لغو نمایید. میتوانید برای مشاهده روند لغو سفارش به توضیحات تکمیلی مراجعه کنید."
    },
    {
        id:4,
        question:"میتوانم سفارشم را بصورت اقساطی ( اعتباری ) پرداخت کنم؟",
        answer:"بله، دیجی کالا تسهیلاتی را فراهم کرده، شما میتوانید تا سقف 20 میلیون تومان به صورت اقساط  با بازپرداخت  6 ، 9 و 12 ماهه از سایت دیجی کالا خرید کنید."
    },
    {
        id:5,
        question:"هزینه ی ارسال در دیجی کالا چگونه محاسبه میشود؟",
        answer:"هزینه ارسال بر اساس شیوه ارسال متفاوت است و در زمان ثبت سفارش نمایش داده می شود."
    },
    {
        id:6,
        question:"چطور درخواست خود را جهت بازگرداندن کالا (مرجوعی کالا) به شما اطلاع دهم؟",
        answer:"شما میتوانید از طریق فرم درخواست مرجوعی در حساب کاربری ، صفحه تماس با ما و تلفن درخواست خود را ثبت نمایید."
    },
    {
        id:7,
        question:"شرایط خرید و بازگرداندن کالا برای کالاهای سوپر مارکتی چگونه است؟",
        answer:"لطفاً پیش از خرید، موارد زیر را به‌دقت بخوانید؛ زیرا ثبت هر سفارش در دیجی‌کالا به معنی موافقت با شرایط زیر است."
    },
]
export default questions;