const data = [
    {name: 'فروردین', uv: 12000000}, 
    {name: 'اردیبهشت', uv: 15000000}, 
    {name: 'خرداد', uv: 13000000}, 
    {name: 'تیر', uv: 18000000}, 
    {name: 'مرداد', uv: 22000000}, 
    {name: 'شهریور', uv: 17500000}, 
    {name: 'مهر', uv: 25000000}, 
    {name: 'آبان', uv: 24200000}, 
    {name: 'آذر', uv: 30000000}, 
    {name: 'دی', uv: 27600000}, 
    {name: 'بهمن', uv: 44000000}, 
    {name: 'اسفند', uv: 63000000}, 
];
export default data

export const uData = [12000000, 15000000, 13000000, 18000000, 22000000, 17500000, 25000000,24200000,30000000,27600000,44000000,63000000];
export const xLabels = [
  'فروردین',
  'اردیبهشت',
  'خرداد',
  'تیر',
  'مرداد',
  'شهریور',
  'مهر',
  'آبان',
  'آذر',
  'دی',
  'بهمن',
  'اسفند'
];